In [3]:
import pandas as pd
df=pd.read_csv("C:\datasets\htitanic_naive.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [4]:
df.isna().sum()

PassengerId      0
Name             0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Survived         0
dtype: int64

In [6]:
import math
mean_age=math.floor(df['Age'].mean())
mean_age

29

In [9]:
df.Age=df['Age'].fillna(mean_age)

In [10]:
df.isna().sum()

PassengerId      0
Name             0
Pclass           0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Survived         0
dtype: int64

In [13]:
#drop all features who dont have impact on survival
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [35]:
target=df.Survived
inputs=df.drop('Survived',axis='columns')
inputs

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female  29.0  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [16]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [36]:
merged=pd.concat([df,dummies],axis='columns')
merged

     Pclass     Sex   Age     Fare  Survived  female  male
0         3    male  22.0   7.2500         0       0     1
1         1  female  38.0  71.2833         1       1     0
2         3  female  26.0   7.9250         1       1     0
3         1  female  35.0  53.1000         1       1     0
4         3    male  35.0   8.0500         0       0     1
..      ...     ...   ...      ...       ...     ...   ...
886       2    male  27.0  13.0000         0       0     1
887       1  female  19.0  30.0000         1       1     0
888       3  female  29.0  23.4500         0       1     0
889       1    male  26.0  30.0000         1       0     1
890       3    male  32.0   7.7500         0       0     1

[891 rows x 7 columns]

In [38]:
final_inputs=merged.drop(['Sex'],axis='columns')
final_inputs

     Pclass   Age     Fare  Survived  female  male
0         3  22.0   7.2500         0       0     1
1         1  38.0  71.2833         1       1     0
2         3  26.0   7.9250         1       1     0
3         1  35.0  53.1000         1       1     0
4         3  35.0   8.0500         0       0     1
..      ...   ...      ...       ...     ...   ...
886       2  27.0  13.0000         0       0     1
887       1  19.0  30.0000         1       1     0
888       3  29.0  23.4500         0       1     0
889       1  26.0  30.0000         1       0     1
890       3  32.0   7.7500         0       0     1

[891 rows x 6 columns]

In [43]:
#train test split
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(final_inputs,target,test_size=0.2)
len(inputs)

891

In [29]:
len(x_train)

712

In [30]:
len(x_test)

179

In [44]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [45]:
#TRAINING MODEL
model.fit(x_train,y_train)

GaussianNB()

In [49]:
model.score(x_test,y_test)

1.0

In [50]:
#predict for first 10 samples
model.predict(x_test[:10])

array([0, 1, 0, 0, 1, 0, 0, 0, 0, 0], dtype=int64)

In [51]:
y_test

648    0
22     1
563    0
502    0
156    1
      ..
299    1
343    0
525    0
490    0
127    1
Name: Survived, Length: 179, dtype: int64

In [52]:
model.predict_proba(x_test[:10])

array([[1., 0.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.]])